In [8]:
import numpy as np
import pandas as pd
import seaborn as sns

### Esercizio 1

In [9]:
data = {
    "Nome": ["Alex", "Giulia", "Stefano"],
    "Regalo": ["Scarpa", "Calzette", "Pantofole"],
    "Prezzo": [10, 22, 33]
}

df = pd.DataFrame(data)
df

      Nome     Regalo  Prezzo
0     Alex     Scarpa      10
1   Giulia   Calzette      22
2  Stefano  Pantofole      33

### Esercizio 2

In [10]:
genders = ["Male"] * 500 + ["Female"] * 500
heights = np.concatenate([
    np.random.normal(174, 6, 500),  
    np.random.normal(168, 7, 500)
])

data1 = pd.DataFrame({"Gender": genders, "Height": heights})
print(data1.head())
print(data1.info())
data1.shape

  Gender      Height
0   Male  177.383185
1   Male  170.509021
2   Male  181.654972
3   Male  181.490584
4   Male  168.061227
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Gender  1000 non-null   object
 1   Height  1000 non-null   float64
dtypes: float64(1), object(1)
memory usage: 15.8+ KB
None

(1000, 2)

### Esercizio 3

In [11]:
df2 = pd.read_csv("titanic.csv")
df2.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [12]:
media = df2.groupby("Pclass")["Age"].mean()
print(media)

Pclass
1    38.233441
2    29.877630
3    25.140620
Name: Age, dtype: float64

### Esercizio 4

In [15]:
num_survived_john = df2[df2["Survived"] == 1]["Name"].str.contains(" John ", na=False, case=False).sum()
print(num_survived_john)

10